 {
    "clientStories": [{
            "id": 1,
            "order": 1,
            "featured": false,
            "featuredHint": "Driving automation, machine learning and analytics with IBM i",
            "company": "Computer Merchants",
            "cardTitle": "Computer Merchants:",
            "companyImage": "assets/images/stories/computermerchants.png",
            "industry": "Computer Services",
            "country": "Australia",
            "leadText": "Driving automation, machine learning<br> and analytics with IBM i",
            "text": "<p>If you’re standing still, you’re falling behind.</p><p>Computer Merchants (CM) of Queensland, Australia, took that saying to heart. Understanding that market disruptors and new technologies are surfacing at a blistering pace, and constantly altering the IT landscape as a result, the company sharpened its competitive edge as a services provider.</p><p>An IBM Business Partner, Computer Merchants buys, sells, trades, rents and leases new and used computer hardware. Specifically, the company provides systems and servers, storage products, desktops and laptops, point-of- sale devices, networking products and software. Computer Merchants also offers maintenance services for IT assets.</p><p><img class='criteria-img criteria-img-left' src='assets/images/stories/computermerchantsoverlay.png'></img>In the spirit of digital innovation and transformation, the company launched two new offerings developed on IBM i and Power Systems. Both offerings—CM View and CM Care—integrated IBM Watson and AI.</p><p>CM View provides a consolidated, real-time view of system performance, allowing Computer Merchants to proactively offer assistance to their clients when issues arise. To further increase efficiencies for clients, the application uses AI to identify issues that most likely require an engineer’s expertise.</p><p>CM Care is an asset management tool that provides clients with a view of their support or maintenance contract. The application also has the ability to analyze client interactions using Watson Tone Analyzer, a service that’s available in the IBM Cloud.</p><p>Using tools that run on IBM i and Power Systems to drive automation, machine learning and analytics, Computer Merchants is entering new markets and safeguarding its business against new disruptors.</p>",
            "previous": "Slaturfelag Suourlands",
            "prev-url": "",
            "next": "Jori",
            "next-url": ""
        },
        {
            "id": 2,
            "order": 2,
            "featured": false,
            "featuredHint": "This content is to be determined",
            "company": "JORI",
            "cardTitle": "JORI:",
            "companyImage": "assets/images/stories/jori.png",
            "industry": "Consumer Products",
            "country": "Belgium",
            "leadText": "Giving customers design power<br> with IBM i and Watson",
            "text": "<p>JORI is a luxury furniture manufacturer based in Belgium. Founded in 1963, it specializes in sofas, armchairs, chairs and reclining seating units in leather or fabric, offering the customer exclusive designs, optimum comfort and high quality. With 170 employees and an annual revenue of around 35.8 million Euro, JORI exports to over 30 countries. As a company, it is committed to both comfort and innovation, with consumer choice and customization its highest priority.</p><p>Customers love to view products before they part with their money. There is also an increased desire for personalization and customization, so each consumer can order something unique to them. The company was struggling to meet this need without overwhelming in-store sellers with options. To solve this challenge, JORI created a web-based 3D configurator tool running on IBM i, giving both customers and their sellers realistic virtual previews of a furniture piece that help close sales faster and accelerate manufacturing.</p><img class='criteria-img criteria-img-right' src='assets/images/stories/jorioverlay.png'></img><p>Working with IBM i Business Partner CD-Invest, JORI built the 3D object database in the integrated Db2 for IBM i, and used IBM i RPGLE web services to communicate via JSON with the front-end configurator program, which also runs on IBM i. The front-end was developed using the Unity open source 3D gaming platform, compiled for i using Chroot. Other open source components used for the solution include Ghostscript and ImageMagick for creating print-outs of furniture built in the configurator tool, Substance for creating realistic-looking fabrics for the 3D models, and Drupal to run the website. The entire stack runs on IBM i in a partition on JORI’s existing IBM Power System S814.</p><p>JORI is branching out into using IBM Watson cognitive technology to help consumers find their preferred furniture fabric. They are creating a solution where the consumer can submit a photo of the fabric they like, and Watson will cross-reference it with their backend product inventory database to find something similar. JORI is looking forward to continuing to grow their business and sales with the help of IBM i, Power Systems and IBM Watson. Learn more about their story and success by reading the case study <a href=\"https://www.ibm.com/case-studies/c223622o41231s41\" target=\"_blank\">here</a>.</p>",
            "previous": "Computer Merchants",
            "prev-url": "",
            "next": "UMOE Restaurants",
            "next-url": ""
        },
        {
            "id": 3,
            "order": 3,
            "featured": false,
            "featuredHint": "This content is to be determined",
            "company": "Mission Produce and Avocado Packing Company",
            "cardTitle": "Mission Produce:",
            "companyImage": "assets/images/stories/mission.png",
            "industry": "Agriculture",
            "country": "Peru",
            "leadText": "IBM i powers the “World’s Finest Avocados”",
            "text": "<p>Mission Produce is the world's largest grower, packer and distributor of fresh Hass avocados. They distribute the fresh fruit all around the world, including China, Japan, Europe, US, Canada, Chile and more. The ability to trace distribution of their product from farm to market is critical to their business success. IT allows them to ensure customer satisfaction. In 2015, they shipped the very first container of Peruvian avocados from Peru to China. This year, they project to produce and distribute 54,000 metric tons of fruit. </p><img class='criteria-img criteria-img-left' src='assets/images/stories/missionoverlay.png'></img><p> After fruit is gathered in the field, the avocados are tracked from the time they leave the farm to when they are packed into bins and then shipped and distributed around the world.Mission Produce at the Avocado Packing Company estimates they produce about 135,000 &mdash; 145,000 pallets per annual growing season in Peru, with 96 lugs of fruit per pallet. These pallets are scanned using tablets with mobile applications built with Zend PHP, and the tracking data is stored in Db2 for IBM i.From there, shipping schedules for the products are created and the scanned records keep track of which boxes are sent where. The application is an end to end solution that also links back to their US corporate systems, and to other systems running around the world.</p><p>In the future, Mission Produce are hoping to connect their IBM i applications to use IBM Watson to optimize various aspects of their business. Using weather data could assist in predicting the start and end of their growing season. Using Watson analytics might help to ensure produce quality control using image recognition, and more. They are looking forward to the future of their business backed by IBM i and Power Systems.</p>",
            "previous": "Umoe Restaurants",
            "prev-url": "",
            "next": "Prolit",
            "next-url": ""
        },
        {
            "id": 4,
            "order": 4,
            "featured": false,
            "featuredHint": "This content is to be determined",
            "company": "Umoe Restaurants",
            "cardTitle": "Umoe Restaurants:",
            "companyImage": "assets/images/stories/umoe.png",
            "industry": "Consumer Goods",
            "country": "Norway",
            "leadText": "Serving up smarter systems",
            "text": "<p>Umoe Restaurants is a restaurant management company based in Norway. They have over 450 restaurants throughout Norway, Sweden and Denmark, including internationally well-known brands such as Burger King, TGI Friday’s, Starbucks and more. They started in the 1970s with one pizza restaurant- Peppes Pizza AS, and have now grown to having over 9,000 full and part-time employees across all brands and locations, including 5 for their IT staff. Umoe provides food and drink concepts in shopping centers and airports.</p><img class='criteria-img criteria-img-left' src='assets/images/stories/umoeoverlay.png'></img><p>As of November, their restaurants generate over 135,000 orders a day, and many locations are open 24 hours a day, 7 days a week. Many of their restaurants have self-service kiosks for customers to order food, which now account for about 45% of their overall takeout orders. At their pizza restaurants and Burger King locations, customers can order food ahead of time via their mobile device, and the company expects soon that 70% of all takeout orders placed at Burger King will be via a mobile device.</p><p>The company has run their operations on IBM i since 1988, starting with a single application they built as an ordering system for home delivery of Peppe’s Pizza. From there, they added a new application for restaurant administration, and now have many business applications running on IBM i for online ordering, kiosks and more. A single IBM i server does all the company financials. Since 2003, the company has also had a disaster recovery machine with MIMIX providing 24x7 availability for the business.</p><p>Since the start, the company has been very happy with IBM i. They believe the future will bring more self-service requirements for their customers, needing systems with high efficiency to integrate with data such as traffic patterns for delivery. The company also believes the need for smarter systems for predictive capabilities such as traffic patterns, delivery times, weather, and more. Umoe Restaurants is looking forward to taking their business into the future with IBM i and Power Systems.</p>",
            "previous": "JORI",
            "prev-url": "",
            "next": "Mission Produce",
            "next-url": ""
        }, {
            "id": 5,
            "order": 5,
            "featured": false,
            "featuredHint": "This content is to be determined",
            "company": "Prolit",
            "cardTitle": "Prolit:",
            "companyImage": "assets/images/stories/prolit.png",
            "industry": "Wholesale Distribution",
            "country": "Germany",
            "leadText": "Reading into their future with IBM i",
            "text": "<p>Prolit Verlagsauslieferung GmbH, based in Fernwald, Germany, supplies books to large retail chains for more than 100 publishers. With more than 100 employees and 20,000 different book titles, Prolit has developed into a dynamically growing service provider, in particular for independent publishers. Their main titles include travel, factual and research books, children’s books as well as other new media categories. This fast- growing business encountered new challenges for the capacity and availability of their IT environment used to support their business.</p><img class='criteria-img criteria-img-left' src='assets/images/stories/prolitoverlay.png'></img><p>The company has been running their business and operations with IBM i and Power Systems since the time of AS/400. To prepare for the future of their rapidly-scaling business, Prolit commissioned IBM Business Partner UBL Informationssysteme to develop a new IT environment. They were looking to modernize their IBM i and Power Systems environment and add a high availability and disaster recovery solution. Prolit needed an easy-to- use and cost-effective solution to ensure that no critical business data would be lost in case of a disaster as well as being high available for their customers and partners.</p><p>Prolit ultimately decided to utilize IBM’s “Cross-Site Mirroring” (XSM) software. An IP- based communication connection is used to mirror all data in the iASP (Independent Auxiliary Storage Pool) on their Power Systems production server to the corresponding disk areas on their backup Power Systems server. The complete implementation of the solution and configuration of the Power Systems servers took only two weeks. With Cross-Site mirroring, Prolit is now able to ensure high availability for their business to support future growth while keeping costs and administration time down. The mirroring of their IBM i environment is completely automated, which means their IT team doesn’t need to constantly monitor the environment to ensure that all the relevant data is being mirrored to their backup Power Systems server.</p>",
            "previous": "Mission Produce",
            "prev-url": "",
            "next": "Computer Merchants",
            "next-url": ""
        }, {
            "id": 6,
            "order": 6,
            "featured": false,
            "featuredHint": "This content is to be determined",
            "company": "Slaturfelag Suourlands",
            "cardTitle": "Slaturfelag Suourlands:",
            "companyImage": "assets/images/stories/slaturfelag.png",
            "industry": "Consumer Goods",
            "country": "Iceland",
            "leadText": "Reducing food waste and much more<br> with web services built on IBM i",
            "text": "<p>Slaturfelag Suðurlands started as a slaughterhouse and meat processing company for farmers in the south part of Iceland in 1907. It was a cooperative, owned by all the farmers in the area. As the company grew, it opened grocery stores that specialized in dry goods like pasta, cereals and rice, imported from all over the world. The company also started expanding into importing plastic hay wrapping, fertilizer and anything else local farmers needed for their operations. It provided these goods to grocery stores across the country. In 1991, it closed all of its grocery stores, realizing that it was competing with its own clients. The company continues to import and supply to grocery stores, and now includes dog and cat food, candy and more. It is also the largest supplier for chicken, chicken products and salads in Iceland.</p><img class='criteria-img criteria-img-left' src='assets/images/stories/slaturfelagoverlay.png'></img><p>Since 1962, Slaturfelag Suðurlands has run its business with IBM technology, starting with a unit record processor and then a System 360. Today, seven of the company’s locations run IBM i 7.3 on POWER8. IBM i and Power Systems are at the heart of their IT environment and the company runs all its business applications on the platform, including Cognos Analytics. Web services are built on IBM i that interface to other business applications. The company also runs its backup and disaster recovery environment on Power Systems using mirroring technology from IBM Business Partner HelpSystems.</p><p>Slaturfelag Suourlands is using the latest iteration of barcodes, called DataBars, allowing it to put the product code and “best before” dates right into the business application code on IBM i. This helps reduce food waste and allows the company to better track the goods for security and freshness. Their market and customers realize the importance of tracking these critical pieces of information. Operating in a small country like Iceland, the company can innovate quickly and try new ideas, better serving their clients and growing its business. The company has recently implemented mobile devices with applications written on IBM i to allow sellers and clients to order goods faster and easier.</p><p>The company loves the security, reliability, ease of use, stability and total cost of ownership of IBM i and it plans to continue to run and grow the business on the Power Systems platform. Current projects include incorporating cognitive computing and artificial intelligence to improve the ability to provide the right products to the right stores at the right time. This would also enable “smart warehousing”- stocking goods closer to the grocery stores and further reducing food waste and cost.</p>",
            "previous": "Deknudt Frames",
            "prev-url": "",
            "next": "computer merchantss",
            "next-url": ""
        }, {
            "id": 7,
            "order": 7,
            "featured": false,
            "featuredHint": "This content is to be determined",
            "company": "Deknudt Frames",
            "cardTitle": "Deknudt Frames:",
            "companyImage": "assets/images/stories/deknudt.png",
            "industry": "Consumer Products",
            "country": "Belgium",
            "leadText": "Building the framework for a thriving<br> e-commerce operation with IBM i",
            "text": "<p>Established in 1923, Deknudt Frames is a Belgian manufacturer specializing in the design, production and distribution of picture frames and wall decorations. A family-run business with an international team of 100 employees, it exports to over 20 countries, delivers to 5,000 retail customers, and has an annual profit of 8 million EUR. With a manufacturing plant in Slovakia and several business partners in the Far East, Deknudt Frames is a truly global company. With many of its retail partners able to stock only a small portion of products, the company needed to create a solution to ensure that consumers weren’t missing out on their favorite items.</p><img class='criteria-img criteria-img-left' src='assets/images/stories/deknudtoverlay.png'></img><p>To offer consumers and resellers easier access to a broader range of products, Deknudt launched an e-commerce solution powered by IBM i and Power Systems. The new solution enables retail partners to streamline inventory management. For the new e-commerce site to be a success, Deknudt Frames required a reliable, flexible operating system that could handle the complexity of the business rules supporting its operations. That is where IBM i and Power Systems came in.</p><p>Working with IBM i Business Partner CD Invest, Deknudt Frames built its new e- commerce platform using common open source web components, including Ghostscript and ImageMagick, running natively on IBM i and a Power System S814 server, alongside other core systems running on IBM i. The company’s retail partners can personalize almost everything on the e-commerce platform, changing the look-and- feel to match their own sites and selecting the precise mix of products they wish to offer. They even have the power to provide discounts to their consumers through a redemption code system, where the retailer essentially passes on part of their sales commission from Deknudt Frames to the end consumer. By building its e-commerce platform directly on IBM i and Power Systems- integrated at the level of the database and existing business rules- Deknudt Frames ensures that updates to the product mix or configuration options immediately and effortlessly flow through to its retail partners and to end consumers.</p><p>By launching its new e-commerce platform on IBM i and Power Systems, Deknudt Frames has expanded its market reach. Retail partners receive an out-of- the-box web store they can integrate into their own websites, streamlined payment and inventory processing, and reduced costs for their own IT administration. In addition, the solution opens up new revenue possibilities for Deknudt Frames’ retail partners. Now they can stock any item in their shop, with the option for the consumer to have the product delivered directly to their home, thus improving their ability to close sales that would not have been possible before.</p><p>Energized by the launch of its white-label e-commerce solution, Deknudt Frames plans to innovate further by integrating email marketing, reminding consumers and retailers of promotional offers during the holiday season, and other business initiatives within their new e-commerce solution backed by IBM i and Power Systems.</p>",
            "previous": "Ibnsina Pharma",
            "prev-url": "",
            "next": "Slaturfelag Suourlands",
            "next-url": ""
        }, {
            "id": 8,
            "order": 8,
            "featured": false,
            "featuredHint": "This content is to be determined",
            "company": "Ibnsina Pharma",
            "cardTitle": "Ibnsina Pharma:",
            "companyImage": "assets/images/stories/ibnsina.png",
            "industry": "Wholesale Distribution",
            "country": "Egypt",
            "leadText": "Handling rapid growth and increased<br> transactional volume with IBM i",
            "text": "<p>It’s a pretty common occurrence these days: The infrastructure that supports a company’s IT systems can’t handle the growing volume of work that’s required to successfully run operations. And when you’re the second-largest pharmaceutical distributor in Egypt, you have to solve that problem—fast.</p><img class='criteria-img criteria-img-left' src='assets/images/stories/ibnsinaoverlay.png'></img><p>That’s why Ibnsina Pharma of Obour, Egypt, turned to IBM i and Power Systems. Founded in 2001, the company relies on the critical support it receives from an IBM business partner to handlethe rapid growth and increased volume that comes with being a transaction-based business.</p><p>With 55 office branches throughout Egypt, including warehouses and call centers, Ibnsina Pharma contacts its clients daily and fulfills orders on a “just-in-time” basis. The company of 6,000 employees has grown its annual revenue to $560M USD and more than 35,000 clients. A staff of 85, including the team responsible for the IBM i and Power Systems environment, oversees all-things IT.</p><p>Talk about an awesome responsibility when you consider all of the business applications, ordering, tracking and delivery that run on IBM i. The entire inventory system is tracked and run on the platform as well.</p><p>What’s more, Ibnsina Pharma continues to increase its capacity with IBM i and Power Systems, which handles millions of transactions a day from all of its branches, warehouses and call centers. The company has pushed its systems and IT environment to the limits without failure or downtime.</p><p>Working without worry, the company continues to grow rapidly. It plans to add 25 new office branches in the next few years. The need to continue streamlining processes is a priority, which has leadership looking at automation and robotics to make warehouse distribution more efficient. Investing in extending tracking systems for trucks and other forms of distribution and transportation is also a focal point.<p/><p>All signs point to a bright future for Ibnsina Pharma. It’s due in large part to running IBM i on Power Systems.</p>",
            "previous": "Nesco Resource",
            "prev-url": "",
            "next": "DEKNUDT FRAMES",
            "next-url": ""
        }, {
            "id": 9,
            "order": 9,
            "featured": false,
            "featuredHint": "This content is to be determined",
            "company": "Nesco Resource",
            "cardTitle": "Nesco Resource:",
            "companyImage": "assets/images/stories/nesco.png",
            "industry": "Professional Services",
            "country": "USA",
            "leadText": "Ensuring an accurate and <br> on time pay day with IBM i",
            "text": "<p>For Nesco Resource, one of the leading national staffing and employment agencies in the U.S., knowing their IT infrastructure has the ability to grow with the business is a top priority. That explains why the company has been a longtime IBM i user, and their IT staff of nine plans to stay with the platform.</p><img class='criteria-img criteria-img-left' src='assets/images/stories/nescooverlay.png'></img><p>Based in Cleveland, Ohio, and privately owned since 1956, the company focuses on all businesses, from harvesters to office temps, processing payroll for 60,000+ temporary employees annually. The self-service web portal built on IBM i allows temporary employees to view paychecks, W2s and time entries.</p><p>Nesco Resource always felt that IBM i and Power Systems did exactly what they needed it to do. Because their temporary employee self-service web portal contains sensitive personal information, it must be highly secure, reliable and available. Ensuring that all temporary employees receive an accurate paycheck on time and can view their information online at any time is paramount.</p><p>RPG/SP from IBM Business Partner Profound Logic was used to build the web portal on the front end, and the TempServ application from IBM i ISV Greenfield was used on the back end. Because high availability is so important to their operation, the company has a disaster recovery machine in addition to its production machine.</p><p>With IBM i and Power Systems, Nesco Resource has all the pieces in place for continuous business growth.</p>",
            "previous": "Mutual distribution company",
            "prev-url": "",
            "next": "Ibnsina Pharma",
            "next-url": ""
        }, {
            "id": 10,
            "order": 10,
            "featured": false,
            "featuredHint": "This content is to be determined",
            "company": "Mutual Distributing Company",
            "cardTitle": "Mutual Distributing Company:",
            "companyImage": "assets/images/stories/mutual.png",
            "industry": "Wholesale Distribution",
            "country": "USA",
            "leadText": "Raising a celebratory glass<br> to IBM i",
            "text": "<p>It’s entirely possible the small IT staff at The Mutual Distributing Company raises a glass to IBM i on occasion.</p><img class='criteria-img criteria-img-left' src='assets/images/stories/mutualoverlay.png'></img><p>Based in Raleigh, N.C., the beer and wine wholesaler relies on IBM i to help its 700 employees run operations across the Carolinas, and serve major grocery chains like Harris Teeter (Kroger) and Food Lion.</p><p>With IBM i, the company’s IT team built an iOS mobile app for inventory management that scans barcodes and communicates through Zend Server. A PHP program calls RPG Service Programs, which integrates with the Db2 for IBM i database that contains product information. Another iOS application is a customer survey app that identifies customers based on their geographic coordinates and provides pins on a map that match the address. When a new customer is created using IBM i, a RPG program makes an API call to Google Maps to get the customer’s geo coordinates.</p><p>The IT team loves the strong connection between the operating system and the database, and how easy it is to write software without worrying about different levels of OS and database. The team also loves how flexible the platform is, and the many choices for programming, including RPG, Node.js, Ruby, Python and PHP.</p><p>The company has used Rational Developer for IBM i since the days of WDSC, and many of their business applications are written in free format RPG code. Power System S814 is their hardware of choice, with a disaster recovery machine using Mimix for replication based in Charlotte. Their software environment is made up of both purchased and internally written applications.</p><p>Looking ahead, the Mutual Distributing Company is considering how to optimize predictive analytics to optimize distribution and sales using IBM Watson. The company has at least 8,000 products that it sells, not to mention decades of customer orders and product data. Using cognitive analytics to make predictions based on customers’ past ordering history has the potential to increase sales and distribution.<p/><p>With a dynamic system in place, the Mutual Distributing Company can quickly and confidently serve their customers, suppliers and employees today and beyond.</p>",
            "previous": "Kube-Pak",
            "prev-url": "",
            "next": "Nesco Resource",
            "next-url": ""
        }, {
            "id": 11,
            "order": 11,
            "featured": false,
            "featuredHint": "This content is to be determined",
            "company": "Kube-Pak",
            "cardTitle": "Kube-Pak:",
            "companyImage": "assets/images/stories/kube-pak.png",
            "industry": "Wholesale Distribution",
            "country": "USA",
            "leadText": "Growing their plant distribution<br> business with IBM i",
            "text": "<p>Maintaining more than 20 acres of gutter-connected, double-poly greenhouses is no small feat. Yet Kube-Pak manages to do it daily, ensuring its potted plants are distributed to grocery stores and gardening centers across the country.</p><img class='criteria-img criteria-img-left' src='assets/images/stories/kube-pakoverlay.png'></img><p>Celebrating 50 years in business, the Allentown, N.J.-based company has been using IBM i on Power Systems for more than 20 years, continually upgrading capacity and capabilities as the need arises. Every aspect of the company’s intensive and highly automated potted plant manufacturing procedure is managed and monitored using home-grown applications running on IBM i and Power Systems. For example, the company has a machine that mixes soil, which is fed into a conveyor belt, dropped into trays and then leveled off. The trays are automatically watered, and they have several different seeding machines that place seeds directly into individual trays. The trays are labeled and allocated a position within their own greenhouse, so the plants can reach a certain level of maturity before being shipped off to customers.</p><p>The dependability of IBM i gives Kube-Pak the scalability they need to expand and update their IT systems in line with the growth of the business. In addition to capacity, reliability and security, the company continues to choose IBM for its extensive levels of support. Their business application development team loves how they can utilize C, PHP, Java and other open source languages on IBM i. The seamless upgrade experience with IBM i and Power Systems is another big bonus.</p><p>Kube-Pak continues to expand and enhance its IBM i landscape as their business grows, enjoying near total uptime, easy compatibility, and a high degree of openness with IBM i. This enables them to continue cultivating excellent client relations.</p><p>This year, Kube-Pak plans to upgrade to POWER9 so they can continue optimizing and enhancing their IT environment and operations for many years to come.<p/>",
            "previous": "Challenger",
            "prev-url": "",
            "next": "Mutual Distributing Company",
            "next-url": ""
        }, {
            "id": 12,
            "order": 12,
            "featured": false,
            "featuredHint": "This content is to be determined",
            "company": "Challenger",
            "cardTitle": "Challenger:",
            "companyImage": "assets/images/stories/challengermotorfreight.png",
            "industry": "Travel and Transportation",
            "country": "Canada",
            "leadText": "Moving North America <br> with IBM i",
            "text": "<p>Staying on top of invoicing is a big job for any company of any size. But that job is giant when you’re Challenger Motor Freight, one of the largest privately owned transportation and logistics companies in Canada.</p><img class='criteria-img criteria-img-left' src='assets/images/stories/challengermotorfreightoverlay.png'></img><p>Serving customers worldwide since 1975, Challenger recognizes the importance of having technological systems and processes that allow it to effectively enter, store and access data across its enterprise. IBM i and Power Systems enable the company to continually set—and surpass—high standards for quality and performance.</p><p>Life before IBM i and Power Systems looked like this: Challenger’s invoicing process relied on multiple systems and time-consuming manual data entry. Employees spent an average of four hours a day manually entering data from a spreadsheet. Challenger also handled third-party logistics and didn’t have an efficient method for receiving invoices from its MercuryGate Transportation Management System (TMS). Both of these procedures took significant effort and required streamlining.</p><p>There didn’t seem to be a quick and convenient fix. Unless they could find a better solution, Challenger programmers would have to rip apart their entire RPG system to access the code in need of an update. The business process codes were also outdated. These modifications would have been extremely disruptive to the business.</p><p>The Newlook solution from IBM i Business Partner looksoftware enabled Challenger to overcome these core challenges quickly and efficiently. Developers wrote new interfaces for the applications that manage and automate the way data is entered and processed through various systems in Challenger’s invoicing routine. In particular, they automated interaction between several of Challenger’s on-prem and cloud systems to greatly facilitate the way invoices are processed.</p><p>The manual data entry that had previously taken four hours a day to complete is now done in minutes. This not only saves employees hours of time, but mitigates possible human error.</p><p>And employees throughout the organization are looking for other ways to achieve new efficiencies or reduce costs. Newlook products enable them to add web services, create new user interfaces and improve integration.</p><p>Challenger is excited by its successful implementation and looks forward to ongoing modernization of its business applications.</p>",
            "previous": "Seylan Bank",
            "prev-url": "",
            "next": "Kube-Pak",
            "next-url": ""
        } ,{
            "id": 13,
            "order": 13,
            "featured": false,
            "featuredHint": "This content is to be determined",
            "company": "Seylan Bank",
            "cardTitle": "Seylan Bank:",
            "companyImage": "assets/images/stories/seylanbank.png",
            "industry": "Banking",
            "country": "Sri Lanka",
            "leadText": "Giving banking a heart <br> with IBM i",
            "text": "<p>From the day it opened for business in 1987, Seylan Bank presented itself as a flexible, customer-friendly option. The bank’s goal was to offer a more welcoming, service- oriented alternative in an industry widely considered too regimented, and its motto quickly caught the attention of prospective customers: “The Bank with a Heart.”</p><img class='criteria-img criteria-img-left' src='assets/images/stories/seylanbankoverlay.png'></img> <p>As a financial institution with a wide reach, the bank needed to see Key Performance Indicators (KPIs) for their core applications, including account behavior, compliance reporting and customer engagement. The process to get data from IBM i to a report and then onto a dashboard, however, took a long time and was very costly. The query- building process alone required extensive manual work to link systems, and each system had different methods for extracting data. Once the query had been performed, the work still wasn’t complete. The data had to be collated and turned into a report to put on a business user’s dashboard.</p> <p>As Seylan Bank looked at solutions for getting better insight into its data, IBM i Business Partner HelpSystems became a frontrunner. The company implemented Sequel Data Access and Sequel Data Warehouse from HelpSystems to bring all of their data on IBM i into a central place.</p> <p>With the new solutions from HelpSystems, Seylan Bank gets current and valuable insights into branch reporting, area reporting, account level reporting and more. To implement the new solutions quickly, the bank utilized the Services team at HelpSystems.</p> <p>Seylan Bank runs its card system and payment system on IBM i and Power Systems, and plans to stay on the platform for years to come, as this access to insight into their data is making a huge difference within their business. The stability, integrated database, performance and strong programming language choices of IBM i provide a strong foundation on which to run banking and data warehousing. Coupled with Sequel solutions from HelpSystems, Seylan Bank is saving time and money, and giving business users valuable information far faster than before.</p>",
            "previous": "Brødrene A&O Johansen A/S",
            "prev-url": "",
            "next": "Challenger",
            "next-url": ""
        } ,{
            "id": 14,
            "order": 14,
            "featured": false,
            "featuredHint": "This content is to be determined",
            "company": "Brødrene A&O Johansen A/S",
            "cardTitle": "Brødrene A&O Johansen A/S",
            "companyImage": "assets/images/stories/brodrene.png",
            "industry": "Wholesale and Distribution",
            "country": "Denmark",
            "leadText": "Helping to build Europe <br> with IBM i",
            "text": "<p>Denmark’s Brdr. A&amp;O Johansen A/S has quickly become more than just a wholesaler and distributor of building and home improvement supplies. They have evolved into an IT logistics company as well.</p> <img class='criteria-img criteria-img-left' src='assets/images/stories/brodreneoverlay.png'></img> <p>And that evolution requires a platform capable of keeping up.</p> <p>In 2006, the company was looking to replace very old technology and evaluated many options. High functionality and local support were top priorities. The old system did not give users the support capability to utilize a modern interface and could not integrate with new technology.</p> <p>Enter IBM i and Power Systems. There’s been no looking back.</p> <p>Today, Brdr. A&amp;O Johansen A/S runs a web portal where customers can go online to order. Brdr. A&amp;O Johansen A/S also implemented robotics in its distribution centers and warehouses to find products and pack orders. The robots run on automated software that integrates with IBM i, freeing many of the 700 employees to focus on higher value business outcomes.</p> <p>Brdr. A&amp;O Johansen A/S believes that the credibility of their business and reputation of its brand is dependent on delivering orders quickly and accurately. Around-the- clock availability is essential. If there is downtime for any reason, the system can failover and production can continue within minutes. Storage replication is on site (MIMIX is used to replicate to the disaster recovery site). The company’s current projects include preparing for GDPR data protection regulations using tools from IBM Business Partner HelpSystems.</p> <p>Brdr. A&amp;O Johansen A/S has more than 50 shops throughout Denmark, Sweden and Norway. As the company continues to grow, IBM i and Power Systems will grow with them.</p>",
            "previous": "Robertet",
            "prev-url": "",
            "next": "Seylan Bank",
            "next-url": ""
        },{
            "id": 15,
            "order": 15,
            "featured": false,
            "featuredHint": "This content is to be determined",
            "company": "Robertet",
            "cardTitle": "Robertet",
            "companyImage": "assets/images/stories/robertet.png",
            "industry": "Consumer Products",
            "country": "France",
            "leadText": "Smelling great <br> with IBM i",
            "text": "<p>The Robertet Group is a French fragrance and flavor manufacturer that specializes in natural raw materials founded in 1850. They are based in Grasse, France (the perfume capital of the world) but operate all over the world throughout North and South America, Europe and Asia, totaling more than 50 countries. The company integrates all stages of the creative process for developing new perfumes and fragrances including sowing, harvesting, transforming, extracting, refining and revealing. A natural partner of fragrances, flavors, healthcare and beauty products, the Robertet Group present exceptional creativity to brand names around the world with the strength of an independent industrial group.</p> <img class='criteria-img criteria-img-left' src='assets/images/stories/robertetoverlay.png'></img> <p>Since the announcement of the AS/400 in 1988, the Robertet Group has been running their business and operations with IBM i and Power Systems. They have Power Systems servers in France for Europe and Mexico for Latin America. They planned to install new Power Systems servers for Asia in Singapore. All their business applications are developed in-house by their team of 8 software developers and 5 system admins. The company utilizes PowerHA for high availability, AJS for daily process automation and BRMS to backup all their data with no interruption using FlashCopy technology. Each server is independent but shares information and data so the company can continue to run throughout the day and night. As they end the day in one time zone, they can continue to operate in another.</p> <p>A main issue that continued to pop up within the company was the resetting and recovering of passwords. This issue continued to waste valuable time by their IT team that should be spent on higher value activities for their business. As with many global companies doing business in many time zones, internal support is not always available. When one time zone was online, another one was not. They were looking for an automated solution. The company looked to IBM Watson to solve this issue and improve productivity and streamline processes.</p> <p>After attending the IBM i University in Paris, the company decided to replicate the demo given by IBMer Christophe Lalevee showing how to utilize Watson in a chatbot to automate the resetting and recovering of passwords. They have been experimenting with various technologies and have now implemented the chatbot using Java and Watson APIs. The company will go into production with their new chatbot later this year and are looking forward to seeing the results and increased productivity by their IT teams.</p> <p>The Robertet Group is looking at other ways to implement Watson into their IBM i environment. In a future project, the company will team up with IBM i Business Partner Profound Logic to modernize their business applications by removing all green screens and adding web interfaces.</p><p>The Robertet Group is looking forward to continuing to innovate with Watson and run their company with IBM i and Power Systems.</p>",
            "previous": "Fibrocit",
            "prev-url": "",
            "next": "Brødrene A&O Johansen A/S",
            "next-url": ""
        },{
            "id": 16,
            "order": 16,
            "featured": false,
            "featuredHint": "This content is to be determined",
            "company": "Fibrocit",
            "cardTitle": "Fibrocit",
            "companyImage": "assets/images/stories/fibrocit.png",
            "industry": "Construction",
            "country": "Belgium",
            "leadText": "Providing a comfortable seat <br> with IBM i",
            "text": "<p>Fibrocit has been the market leader in the Benelux region for the production and installation of fixed seating solutions for more than 90 years. The company offers a complete service- from the study, design, production and installation of the seats. Their technical team provides customers with expert advice on sight lines, positioning and legal standards. Fibrocit’s seating solutions can be found in organizations operating in the culture, education, business, hospitality and sport sectors across Europe. They cultivate expert craftsmanship from decades of design experience and helping customers create the best seating solution possible for their venue or property.</p> <img class='criteria-img criteria-img-left' src='assets/images/stories/fibrocitoverlay.png'></img> <p>They were looking to automate their design, planning and business processes to improve customer service and speed up their time to market. The company teamed up with IBM i Business Partner CD Invest to develop a set of business applications running on IBM i in a private cloud hosted on Power Systems, empowering the company to modernize its core operations. CD Invest is working with Fibrocit to develop a project management and integrated accountancy system as well as other innovative business applications running on IBM i and Power Systems.</p> <p>To aid in the seating design process, CD Invest is also helping Fibrocit build a 3D configurator tool, which will enable its teams to build and adapt designs on three- dimensional photographs of customer’s spaces they are working on. Once developed, the company aims to use this application to give clients an impression of how the finished product will look using augmented reality. They won’t stop there however, Fibrocit is also building a visual-recognition application with the aim of automating its quality-control processes.</p> <p>With a new suite of business applications running on IBM i and Power Systems in a private cloud, the company can keep projects running smoothly and complete work much more effectively, while establishing a platform for future innovation for their business. The company expects to achieve greater accuracy and efficiency in their design process using the new 3D configurator tool by automating the room measurement process and decreasing the time needed to build a new design for a customer. By driving innovation and operational efficiency today, the company can ensure that they will be keeping audiences comfortable in the decades ahead.</p> <p>Fibrocit is looking forward to another century and more of serving customers with the best service and workmanship possible, backed by IBM i and Power Systems.</p>",
            "previous": "Caixa Geral de Depositos",
            "prev-url": "",
            "next": "Robertet",
            "next-url": ""
        },{
            "id": 17,
            "order": 17,
            "featured": false,
            "featuredHint": "This content is to be determined",
            "company": "Caixa Geral de Depositos",
            "cardTitle": "Caixa Geral de Depositos",
            "companyImage": "assets/images/stories/caixabank.png",
            "industry": "Banking",
            "country": "France",
            "leadText": "Speeding credit approval times <br> with IBM i and Watson",
            "text": "<p>Caixa Geral de Depositos is a universal bank with 48 branches throughout France. A subsidiary of the largest bank in Portugal, CGD France provides a broad range of services including current accounts, credit cards, savings, loans, business financing, treasury, insurance and international development to enterprises, small and medium sized businesses and private individuals. Inefficient paper-based credit scoring at CGD France delayed loan applications, requiring customers to visit their branch office twice for a decision, which also raised the risk that they would walk away and choose another bank. This was the challenge facing the bank and their IT team to solve.</p><img class='criteria-img criteria-img-left' src='assets/images/stories/caixabankoverlay.png'></img><p>The bank worked with EVEA and Fabrick within the Constellation group, an IBM Business Partner, to create a hybrid cloud credit-scoring application that uses advanced machine learning with IBM Watson to rapidly and accurately determine each customer’s credit-worthiness. There were two key objectives for the credit-scoring application project: first, to give credit analysts a tool for modeling and maintaining multiple risk models for various types of customers, and second, to use these models to perform real-time scoring for loan applications. With mobile salespeople able to give decisions to applicants in almost real time, the new application boosts the bank’s competitive edge and provides a repeatable model for further process optimization.</p><p>Fabrick helped develop the new credit-scoring application on the IBM Cloud using an agile development methodology and taking advantage of both containers and microservices. The scoring-management module consumes an IBM Watson service via a simple API call. This IBM Watson service provides the sophisticated analytical capabilities to accurately determine credit-worthiness across a flexible variety of criteria in almost real time. The solution elements running on the IBM Cloud connect back to CGD France’s core banking system which runs on IBM i and Power Systems in their private data center.</p><p>The credit-scoring solution deployed by CGD France and Constellation has successfully met both of original objectives; accelerating decisions on personal loans and enabling the bank to comply with industry regulations. With a cross-platform application that delivers decisions on credit-worthiness in almost real time, the banks’ salespeople can provide a better, faster service to customers in practically any location and on any device. Those customers get a decision right away rather than needing to make two separate visits to a CGD France branch, and salespeople are no longer left hanging on the telephone waiting for decisions from their head office. With a hybrid cloud environment that integrates cloud-hosted components with core banking systems on IBM i and Power Systems, CGD France has increased the flexibility and scalability of its services without compromising on stability, security or cost of ownership.<p/>",
            "previous": "Wilton",
            "prev-url": "",
            "next": "Fibrocit",
            "next-url": ""
        },{
            "id": 18,
            "order": 18,
            "featured": false,
            "featuredHint": "This content is to be determined",
            "company": "Wilton",
            "cardTitle": "Wilton",
            "companyImage": "assets/images/stories/wilton.png",
            "industry": "Consumer Products",
            "country": "USA",
            "leadText": "Baking cakes<br> with IBM i",
            "text": "<p>Wilton Brands is a premium producer of baking supplies such as cake pans, icing tips and cupcake liners based in Chicago, Illinois. They are passionate about bringing the love of baking and decorating to everyone, everywhere, every day. They’re constantly evolving their business to bring their customers quality products that make baking and decorating fun and easy. Wilton distributes their products throughout the US and Canada, as well as globally through their sales partners, Amazon and Walmart.</p><img class='criteria-img criteria-img-left' src='assets/images/stories/wiltonoverlay.png'></img><p>The company runs their business with IBM i and Power Systems, including their warehouse operations and supply chain. Wilton has a 1 million square foot warehouse in Chicago, so the management and operation of their space and inventory is critical to their business. They use JD Edwards ERP and warehouse management solution Logistics Pro. The backend operations of the company also run on IBM i and Power Systems.</p><p>Wilton enjoys the scalability, flexibility and availability of IBM i and Power Systems. The platform allows capacity growth on demand to support the future needs of their business. They like the fact that they can grow their system as their business grows; licensing one core at a time to improve total cost of ownership. Additionally, they are able to adjust capacity to support varying workloads. As much of their business is supporting their partners, high availability is critical to their business and operations. The support and service they receive from IBM is second to none.</p><p>Wilton is looking into the future of their business with IBM i and Power Systems. They are looking at using data and analytics in advanced ways to streamline and improve their supply chain. As Wilton continues to growth internationally through e-commerce, the optimization of their operations and distribution is critical. The company is looking forward to continuous growth and success of their company with the support of IBM i and Power Systems.<p/>",
            "previous": "Krengeltech",
            "prev-url": "",
            "next": "Caixa Geral de Depositos",
            "next-url": ""
        },{
            "id": 19,
            "order": 19,
            "featured": false,
            "featuredHint": "This content is to be determined",
            "company": "Krengeltech",
            "cardTitle": "Krengeltech",
            "companyImage": "assets/images/stories/krengeltech.png",
            "industry": "Computer Services",
            "country": "USA",
            "leadText": "Making IBM i accessible<br> for all",
            "text": "<p>Krengeltech is an IBM business partner and independent software vendor from Mankato, Minnesota. Krengeltech’s solutions packages include RPG toolkits for processing JSON and XML web services, cloud hosting, credit card processing toolkits and UPS/FedEx shipping toolkits. Each of these packages lets RPG developers maximize their investment in IBM i and Power Systems, either by extending their RPG environment or by implementing open source options on IBM i. With a customer installed base spanning over 20 countries and several Fortune 500 companies, the Krengeltech infrastructure meets high availability demands while maintaining the Midwest work ethic instilled at the company’s core.</p><img class='criteria-img criteria-img-left' src='assets/images/stories/krengeltechoveraly.png'></img><p>The company realized there was a gap in the market for skill development on IBM i. They recognized a new generation of application developers lacked the opportunity to gain experience on IBM i and Power Systems, potentially putting them at a disadvantage in the employment market. To democratize access to IBM i, Krengeltech worked with IBM to build a set of single-tenant and multi-tenant cloud services called Litmis Spaces using logical partitions on Power Systems. Anyone can sign up for a free multi-tenant account on Litmis Spaces and get started on a personal or company project.</p><p>As needs grow, the user can move into a single-tenant offering where they can pay a flexible monthly fee based on the resources needed. Corporate users of IBM i are signing up to create hybrid clouds spanning their on-premise infrastructure and dedicated resources on Litmis Spaces, including their production workloads. Krengeltech is also offering educational services to programmers such as specialized tutorials to help them develop their IBM i skills through articles and labs. These educational services, called Litmis Learn, can be consumed on their multi-tenant IBM i cloud service at no cost.</p><p>With its new IBM i cloud offerings, Krengeltech is giving students, developers and companies rapid, easy and efficient access to a feature-rich IBM i development platform starting from zero cost. Hundreds of users are actively building software in this multi- tenant landscape using open source tools running natively on IBM i and Power Systems. When users decide to go into production, they can simply use a credit card to set up a dedicate single-tenant environment by selecting the amount of CPU, memory and disk they need. For independent developers and small-to-midsize companies, Krengeltech’s Litmis Spaces hosting solutions provide the freedom to push innovation to the next level.<p/>",
            "previous": "Sunstate",
            "prev-url": "",
            "next": "Wilton",
            "next-url": ""
        },{
            "id": 20,
            "order": 20,
            "featured": true,
            "featuredHint": "This content is to be determined",
            "company": "Sunstate",
            "cardTitle": "Sunstate",
            "companyImage": "assets/images/stories/sunstate.png",
            "industry": "Construction",
            "country": "USA",
            "leadText": "Supplying construction sites<br> with IBM i",
            "text": "<p>Sunstate Equipment provides construction, industrial and special event companies with top-quality construction rental equipment and tools. Their reliable service and dedication to their customers continues to help them get their job done efficiently and safely. They currently have rental locations throughout Georgia, California, Nevada, Utah, Colorado, Arizona, New Mexico, Oklahoma, Texas and Tennessee. The company offers a full line of well-maintained construction equipment and machinery, from hand tools to heavy equipment. Everybody within the company works together to ensure each customer order is completed and delivered in excellent working condition and on time.</p><img class='criteria-img criteria-img-left' src='assets/images/stories/sunstateoverlay.png'></img><p>In 2016, the company rolled out a major change with wide-reaching effects when they introduced the Material Management System (MMS). MMS completely digitized parts procurement, inventory control and the workflow of equipment moving through the shop for service. This radical change also had a learning curve as tablets replaced physical POs, service manuals and parts lists. All those things clearly made it better for their employees to do their jobs better and get work done faster. This new system is being run with PHP on IBM i and Power Systems.</p><p>The company has seen major positive influences on their business with this new system. They have been able to reduce the number of people ordering parts from over 100 to just 12. This has allowed many employees to focus on other business critical tasks to further improve customer service and operations. Sunstate has challenged themselves to improve each step of the workflow process. They can quickly source equipment that is in high demand that previously may have been unavailable due to excessive paperwork and other procedural delays.</p><p>Sunstate doesn’t take the task of challenging themselves to do better lightly. With MMS, the company believes this is just one example of challenging themselves to do better and serve their customers at an even higher level. The new system has made processes easier, more streamlined and more manageable so they can focus on their customers even more. This is the only way that the company knows how to do business. Sunstate is looking forward to many more years of continuing to get better and serve their customers with IBM i and Power Systems.<p/>",
            "previous": "FRS",
            "prev-url": "",
            "next": "Krengeltech",
            "next-url": ""
        },{
            "id": 21,
            "order": 21,
            "featured": true,
            "featuredHint": "This content is to be determined",
            "company": "FRS",
            "cardTitle": "FRS",
            "companyImage": "assets/images/stories/frs.png",
            "industry": "Wholesale Distribution",
            "country": "USA",
            "leadText": " Keeping kitchens stocked<br> with IBM i",
            "text": "<p>FRS is a food service and restaurant supply company that supplies commercial kitchens with pots, pans, dishes, glassware, cutlery and more. These kitchens are based in restaurants, hospitals, offices and schools. They also provide china, silverware, display cabinets, appliances and more items to these commercial kitchens. FRS has repetitive business and operations, as glassware and other kitchen items are often broken by customers and need to be replaced. The company is based in Charleston, South Carolina.</p><img class='criteria-img criteria-img-left' src='assets/images/stories/frsoverlay.png'></img><p>The company runs their business with IBM i and Power Systems at the core. In addition to regular business operations for a distribution company, FRS also stores images, receiving documents, invoices and other business critical items on IBM i. They use a disaster recovery service in the cloud from IBM i business partners that runs 24x7 to keep their business and operations highly available. The goal of the FRS IT organization is to stay current, allowing them to support new business needs and enable the highest level of customer service possible.</p><p>Another part of FRS’s business does dishwasher rental. The company supplies all the chemicals to customers’ kitchens that are used in the dishwashers including things like soap. The company’s service reps used to manually keep up with data regarding customer orders; difficult to remain accurate in a system with 3-part forms. The company was able to streamline this process by creating a web form on IBM i for all this data to be tracked simply and accurately to improve customer service and decease mistakes and ineffectiveness. Because of this modernization project on IBM i, their dishwasher rental business went from a struggling and complex part of their company to being one of the most profitable and streamlined within FRS.</p><p>The company is currently developing a customer web portal application to allow specific clients to place their own orders as well as view and track orders. This portal will be accessible from any device and will allow their clients to place and track orders 24 hours a day, 7 days a week. Their development team is looking at using PHP and other open source solutions to help build out this web portal on IBM i. This new web application will allow the company to meet their customers demand of placing and tracking orders when, where and how they want.<p/><p>FRS is able to have all four of their locations online 24/7 with IBM i and Power Systems, allowing for up to date data for all their employees. Because they are running on one system, the company can centrally manage all facets of their business, including accounts receivable and payable, purchasing, billing and more. All of these functions are integration with IBM i. The company is looking forward to many more years of growth and success for their business with IBM i and Power Systems.</p>",
            "previous": "",
            "prev-url": "",
            "next": "Sunstate",
            "next-url": ""
        }
    ]
}
